app/controllers/users_controller.rb

INSERT INTO "users" ("username", "highscore", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["username", "Camille"], ["highscore", 9], ["created_at", "2018-03-28 18:36:29.195479"], ["updated_at", "2018-03-28 18:36:29.195479"]]
---
  def create
    @user = User.create(user_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
UPDATE "users" SET "highscore" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["highscore", 86], ["updated_at", "2018-03-28 21:37:47.075783"], ["id", 9]]
---
  def update
    @user = User.find(params[:id]).update(user_params)